/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   init_scream.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mcesar-d <mcesar-d@student.42sp.org.br>    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/10/31 22:50:29 by mcesar-d          #+#    #+#             */
/*   Updated: 2022/10/31 23:30:32 by mcesar-d         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "minishell.h"

void	init_scream(void)
{
	ft_putstr_fd("\n\n", 1);
	ft_putstr_fd(" ººº       ººº  ººº  ººº    ººº  ººº \n", 1);
	ft_putstr_fd(" ºººº     ºººº  ººº  ºººº   ººº  ººº \n", 1);
	ft_putstr_fd(" ººººº   ººººº  ººº  ººººº  ººº  ººº \n", 1);
	ft_putstr_fd(" ººº  º º  ººº  ººº  ººº  ººººº  ººº \n", 1);
	ft_putstr_fd(" ººº   º   ººº  ººº  ººº   ºººº  ººº \n", 1);
	ft_putstr_fd(" ººº       ººº  ººº  ººº    ººº  ººº \n", 1);
	ft_putstr_fd("\n", 1);
	ft_putstr_fd(" SHELL +++++++++++++++++++++++++++++ \n", 1);
	ft_putstr_fd(" +++++ SHELL +++++++++++++++++++++++ \n", 1);
	ft_putstr_fd(" +++++++++++ SHELL +++++++++++++++++ \n", 1);
	ft_putstr_fd(" +++++++++++++++++ SHELL +++++++++++ \n", 1);
	ft_putstr_fd(" +++++++++++++++++++++++ SHELL +++++ \n", 1);
	ft_putstr_fd(" +++++++++++++++++++++++++++++ SHELL \n", 1);
	ft_putstr_fd("\n\n", 1);
}
